package cn.geekduxu.xguesssong.data;

public class Const {

    public static final String SONG_INFO[][] = {
            {"__00000.m4a", "1", "征服"},
            {"__00001.m4a", "1", "童话"},
            {"__00002.m4a", "1", "同桌的你"},
            {"__00003.m4a", "1", "七里香"},
            {"__00004.m4a", "1", "传奇"},
            {"__00005.m4a", "1", "大海"},
            {"__00006.m4a", "1", "后来"},
            {"__00007.m4a", "1", "你的背包"},
            {"__00008.m4a", "1", "再见"},
            {"__00009.m4a", "1", "老男孩"},
            {"__00010.m4a", "1", "龙的传人"},
    };

}
